#include "visualscope.h"
/*--------------------------------------程序定义-----------------------------------*/
/*-------------------------------------------------------
虚拟示波器发送函数。
-------------------------------------------------------*/
void vs_send(u8 id,u8 ch,s16 * dat){
	u8 temp[9],i,ch_max;
	if(ch>4){
		ch_max=4;
	}else{
		ch_max=ch;
	}
	for(i=0;i<9;i++){
		temp[i]=0;
	}
	for(i=0;i<ch_max;i++){
		temp[i*2+0]=(u8)((u16)(dat[i]));
		temp[i*2+1]=(u8)((u16)(dat[i])>>8);
	}
	for(i=0;i<8;i++){
		temp[8]+=temp[i];
	}
	for(i=0;i<9;i++){
		uart_char(id,temp[i]);
	}
}
